#include <stdio.h>

/*
	指针如果要跟数组写法一模一样，前提条件是该指针类型必须跟数组名代表的指针类型一致
*/
int main()
{
	int i,j;
	int a[7][10]={45,62,78,96};

    
	/*
	通过指针来遍历这个二维数组
	写法1：
	int *p=&a[0][0];//等价于int *p=a[0];   
	for(i=0; i<70; i++)
	{
		printf("*(p+%d) is: %d\n",i,*(p+i));
	}
	
	for(i=0; i<7; i++)
	{
		for(j=0; j<10; j++)
			错误的：指针如果要跟数组写法一模一样，前提条件是该指针类型必须跟数组名代表的指针类型一致
			此时p的类型是int *，而数组名a的类型是int(*)[10]
			printf("模仿数组名的写法p[%d][%d] is: %d\n",i,j,p[i][j]);
	}
	*/


	//写法2：受到第19--24行代码的启发，定义一个指针跟数组名a类型相同，不就解决问题吗
	int (*q)[10]=a;  //q跟a类型一致，因此可以等价替换
	for(i=0; i<7; i++)
	{
		for(j=0; j<10; j++)
			printf("模仿数组名的写法q[%d][%d] is: %d\n",i,j,q[i][j]);
	}
	
}